domenpk/cbaos/arch/arm7tdmi/mach-lpc21xx/include/lpc21xx_gpio.h
#ifndef _ARCH_GPIO_H_
#define _ARCH_GPIO_H_

// TODO check if these are pins for lpc21xx or only lpc213x

#define GPIO_0_0	0x4000
#define GPIO_0_1	0x4001
#define GPIO_0_2	0x4002
#define GPIO_0_3	0x4003
#define GPIO_0_4	0x4004
#define GPIO_0_5	0x4005
#define GPIO_0_6	0x4006
#define GPIO_0_7	0x4007
#define GPIO_0_8	0x4008
#define GPIO_0_9	0x4009
#define GPIO_0_10	0x400a
#define GPIO_0_11	0x400b
#define GPIO_0_12	0x400c
#define GPIO_0_13	0x400d
#define GPIO_0_14	0x400e
#define GPIO_0_15	0x400f
#define GPIO_0_16	0x4010
#define GPIO_0_17	0x4011
#define GPIO_0_18	0x4012
#define GPIO_0_19	0x4013
#define GPIO_0_20	0x4014
#define GPIO_0_21	0x4015
#define GPIO_0_22	0x4016
#define GPIO_0_23	0x4017
/*#define GPIO_0_24	0x4018 not available on lpc213x */
#define GPIO_0_25	0x4019
#define GPIO_0_26	0x401a
#define GPIO_0_27	0x401b
#define GPIO_0_28	0x401c
#define GPIO_0_29	0x401d
#define GPIO_0_30	0x401e
#define GPIO_0_31	0x401f

/* GPIO_1_0 .. GPIO_1_15 are not available on lpc213x */
#define GPIO_1_16	0x4110
#define GPIO_1_17	0x4111
#define GPIO_1_18	0x4112
#define GPIO_1_19	0x4113
#define GPIO_1_20	0x4114
#define GPIO_1_21	0x4115
#define GPIO_1_22	0x4116
#define GPIO_1_23	0x4117
#define GPIO_1_24	0x4118
#define GPIO_1_25	0x4119
#define GPIO_1_26	0x411a
#define GPIO_1_27	0x411b
#define GPIO_1_28	0x411c
#define GPIO_1_29	0x411d
#define GPIO_1_30	0x411e
#define GPIO_1_31	0x411f

#endif
